tutorials/cfdemSolverMultiphase/tankDrainage/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// General m4 macros

  


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// User-defined parameters

convertToMeters 0.01;














// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Derived parameters






// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Parametric description

vertices
(
        (0 0 0)	 			//0
        (0 2.82190275490383 0)	 		//1
        (0 5.17809724509617 0)	 		//2
        (0 8.0 0)	 		//3
        (0 0 3)		//4
        (0 2.82190275490383 3)	//5
        (0 5.17809724509617 3)	 	//6
        (0 8.0 3)	 	//7
        (0 0 20.0)	 	//8
        (0 2.82190275490383 20.0)	//9
        (0 5.17809724509617 20.0)	//10
        (0 8.0 20.0)	//11
        (0 0 25.0)	 		//12
        (0 2.82190275490383 25.0)	 	//13
        (0 5.17809724509617 25.0)	 	//14
        (0 8.0 25.0)	 	//15
        (30.0 0 0)	 		//16
        (30.0 2.82190275490383 0)	 	//17
        (30.0 5.17809724509617 0)	 	//18
        (30.0 8.0 0)	 		//19
        (30.0 0 3)		//20
        (30.0 2.82190275490383 3)	//21
        (30.0 5.17809724509617 3)	//22
        (30.0 8.0 3)	//23
        (30.0 0 20.0)	//24
        (30.0 2.82190275490383 20.0)//25
        (30.0 5.17809724509617 20.0)	//26
        (30.0 8.0 20.0)	//27
        (30.0 0 25.0)	 	//28
        (30.0 2.82190275490383 25.0)	//29
        (30.0 5.17809724509617 25.0)	 	//30
        (30.0 8.0 25.0)	 	//31
);

blocks
(
    hex (0 16 17 1 4 20 21 5) (22 2 2) simpleGrading (1 1 1)		
    hex (1 17 18 2 5 21 22 6) (22 2 2) simpleGrading (1 1 1)	
    hex (2 18 19 3 6 22 23 7) (22 2 2) simpleGrading (1 1 1)	
    hex (4 20 21 5 8 24 25 9) (22 2 10) simpleGrading (1 1 1)		
    hex (5 21 22 6 9 25 26 10) (22 2 10) simpleGrading (1 1 1)	
    hex (6 22 23 7 10 26 27 11) (22 2 10) simpleGrading (1 1 1)	
    hex (8 24 25 9 12 28 29 13) (22 2 3) simpleGrading (1 1 1)	
    hex (9 25 26 10 13 29 30 14) (22 2 3) simpleGrading (1 1 1)	
    hex (10 26 27 11 14 30 31 15) (22 2 3) simpleGrading (1 1 1)	
);

edges
(
);

boundary
(
    atmosphere
    {
	type patch;
	faces
        (
	    (12 28 29 13)
	    (13 29 30 14)
	    (14 30 31 15)
        );
    }

    outlet
    {
	type patch;
	faces
	(
	    (1 5 6 2)
	);
    }

    walls
    {
	type wall;
	faces
	(
	   //Left
 	   (0 4 5 1) 
	   (2 6 7 3)
	   (4 8 9 5)
	   (5 9 10 6)
 	   (6 10 11 7) 
	   (8 12 13 9)
	   (9 13 14 10)
	   (10 14 15 11) 
 
	   //Back
	   (3 7 23 19) 
	   (7 11 27 23)
	   (11 15 31 27)

	   //Right
	   (16 17 21 20)
	   (17 18 22 21)
	   (18 19 23 22) 
	   (20 21 25 24)  
	   (21 22 26 25)
	   (22 23 27 26)
	   (24 25 29 28) 
	   (25 26 30 29)  
	   (26 27 31 30)  
	   
	   //Front
	   (0 16 20 4) 
	   (4 20 24 8)
	   (8 24 28 12)

	   //Bottom
	   (0 16 17 1)
	   (1 17 18 2)
	   (2 18 19 3)
	);
    }  
);

// ************************************************************************* //
