tutorials/cfdemSolverMultiphase/tankDrainage/CFD/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
     water
     {
         transportModel Newtonian;
         nu nu [ 0 2 -1 0 0 0 0 ] 1e-06;  
         rho rho [ 1 -3 0 0 0 0 0 ] 1000; 
     }

     oil
     {
         transportModel Newtonian;
         nu nu [ 0 2 -1 0 0 0 0 ] 1e-06;
         rho rho [ 1 -3 0 0 0 0 0 ] 700; 
     }

     air
     {
         transportModel Newtonian;
         nu nu [ 0 2 -1 0 0 0 0 ] 1e-05;
         rho rho [ 1 -3 0 0 0 0 0 ] 1; 
     }
);

sigmas
(
    (water oil) 0.07
    (air water) 0.07
    (air oil) 0.07

);


// ************************************************************************* //
