tutorials/cfdemSolverMultiphase/tankDrainage/CFD/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
    volScalarFieldValue alpha.oil 0
    volVectorFieldValue U ( 0 0 0 )
);

regions
(
    boxToCell
    {
        box ( 0 0 0 ) ( 0.3 0.08 0.18 );
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue alpha.air 0
        );
    }

    boxToCell
    {
        box ( 0 0 0.18 ) ( 0.3 0.08 0.22 );
        fieldValues
        (
            volScalarFieldValue alpha.oil 1
            volScalarFieldValue alpha.air 0
        );
    }

);


// ************************************************************************* //
